Repository: nhattanlht/Group23-Ex-Sat
Catalog: Backend/Resources/SharedResource.*.resx
Languages: vi

# GetStudentsSuccess
source: Students retrieved successfully.
vi: Lấy danh sách sinh viên thành công.

source: Invalid student data.
vi: Dữ liệu sinh viên không hợp lệ.

# InvalidModelState
source: Invalid data.
vi: Dữ liệu không hợp lệ.

source: Student not found.
vi: Không tìm thấy sinh viên.

# GetStudentSuccess
source: Student information retrieved successfully.
vi: Lấy thông tin sinh viên thành công.

# CreateStudentSuccess
source: Student created successfully.
vi: Thêm sinh viên thành công.

# CreateStudentError
source: Failed to create student.
vi: Thêm sinh viên thất bại.

# UpdateStudentSuccess
source: Student updated successfully.
vi: Cập nhật sinh viên thành công.

# UpdateStudentError
source: Failed to update student.
vi: Cập nhật sinh viên thất bại.

# StudentIdMismatch
source: Student ID does not match.
vi: Mã số sinh viên không khớp.

# DeleteStudentSuccess
source: Student deleted successfully.
vi: Xóa sinh viên thành công.

# DeleteStudentError
source: Failed to delete student.
vi: Xóa sinh viên thất bại.

# SearchStudentsSuccess
source: Students search successful.
vi: Tìm kiếm sinh viên thành công.

source: Internal server error.
vi: Lỗi máy chủ nội bộ

# GetAllCoursesSuccess
source: Course list retrieved successfully.
vi: Lấy danh sách khóa học thành công.

# GetActiveCoursesSuccess
source: Active courses retrieved successfully.
vi: Lấy danh sách khóa học đang hoạt động thành công.

source: Course not found.
vi: Khóa học không tồn tại.

# GetCourseSuccess
source: Course information retrieved successfully.
vi: Lấy thông tin khóa học thành công.

# CreateCourseSuccess
source: Course created successfully.
vi: Khóa học đã được tạo thành công.

# UpdateCourseCreditsError
source: Cannot update course credits for courses with registered students.
vi: Không thể cập nhật số tín chỉ của khóa học đã có sinh viên đăng ký

# CourseCreditsMinError
source: Credits must be greater than or equal to 2.
vi: Số tín chỉ phải lớn hơn hoặc bằng 2

source: Prerequisite course not found.
vi: Khóa học tiên quyết không tồn tại

# UpdatePrerequisiteCourseError
source: Cannot update prerequisite course for courses with registered students.
vi: Không thể cập nhật khóa học tiên quyết của khóa học đã có sinh viên đăng ký

# UpdateCourseError
source: Failed to update course.
vi: Cập nhật khóa học thất bại

# UpdateCourseSuccess
source: Course updated successfully.
vi: Cập nhật khóa học thành công

# DeleteCourseError
source: Failed to delete course. Please check again.
vi: Xóa khóa học thất bại. Vui lòng kiểm tra lại.

# DeleteCourseSuccess
source: Course deleted successfully.
vi: Khóa học đã được xóa thành công.

source: Invalid identification data.
vi: Dữ liệu CMND/CCCD không hợp lệ.

# CreateIdentificationSuccess
source: Identification created successfully.
vi: Tạo CMND/CCCD thành công.

# CreateIdentificationError
source: An error occurred while creating identification.
vi: Đã xảy ra lỗi khi tạo CMND/CCCD.

source: Identification not found!
vi: Không tìm thấy CMND/CCCD!

# GetIdentificationSuccess
source: Identification information retrieved successfully.
vi: Lấy thông tin CMND/CCCD thành công.

# GetAllClassesSuccess
source: Class list retrieved successfully.
vi: Lấy danh sách lớp học thành công.

source: Class not found.
vi: Lớp học không tồn tại.

# GetClassSuccess
source: Class information retrieved successfully.
vi: Lấy thông tin lớp học thành công.

# CreateClassSuccess
source: Class created successfully.
vi: Lớp học đã được tạo thành công.

# UpdateClassSuccess
source: Class updated successfully.
vi: Lớp học đã được cập nhật thành công.

# DeleteClassSuccess
source: Class deleted successfully.
vi: Lớp học đã được xóa thành công.

source: Invalid class data.
vi: Dữ liệu không hợp lệ.

# GetAllEnrollmentsSuccess
source: Enrollments retrieved successfully.
vi: Lấy danh sách đăng ký thành công.

source: Enrollment not found.
vi: Đăng ký không tồn tại.

# GetEnrollmentSuccess
source: Enrollment information retrieved successfully.
vi: Lấy thông tin đăng ký thành công.

# PrerequisiteNotCompletedError
source: The student has not completed the prerequisite courses.
vi: Học viên chưa hoàn thành các khóa học tiên quyết.

# ClassFullError
source: The class is full.
vi: Lớp học đã đầy.

# CreateEnrollmentSuccess
source: Enrollment created successfully.
vi: Đăng ký thành công.

# CancelEnrollmentDeadlineError
source: Cannot cancel enrollment because the deadline has passed.
vi: Không thể hủy đăng ký do đã quá hạn.

# CancelEnrollmentSuccess
source: Enrollment cancelled successfully.
vi: Hủy đăng ký thành công.

# UpdateEnrollmentSuccess
source: Enrollment updated successfully.
vi: Cập nhật đăng ký thành công.

# DeleteEnrollmentSuccess
source: Enrollment deleted successfully.
vi: Đăng ký đã được xóa thành công.

# GetAllGradesSuccess
source: Grades retrieved successfully.
vi: Lấy danh sách điểm thành công.

source: Grade not found.
vi: Điểm không tồn tại.

# GetGradeSuccess
source: Grade information retrieved successfully.
vi: Lấy thông tin điểm thành công.

# CreateGradeSuccess
source: Grade created successfully.
vi: Điểm đã được tạo thành công.

# UpdateGradeSuccess
source: Grade updated successfully.
vi: Điểm đã được cập nhật thành công.

# DeleteGradeSuccess
source: Grade deleted successfully.
vi: Điểm đã được xóa thành công.

# PhoneNumberRequired
source: Phone number is required.
vi: Số điện thoại không được để trống.

# PhoneNumberInvalid
source: Invalid phone number.
vi: Số điện thoại không hợp lệ.

# PhoneNumberExists
source: Phone number already exists in the system.
vi: Số điện thoại đã tồn tại trong hệ thống.

# EmailRequired
source: Email is required.
vi: Email không được để trống.

# EmailInvalid
source: Invalid email.
vi: Email không hợp lệ.

# EmailExists
source: Email already exists in the system.
vi: Email đã tồn tại trong hệ thống.

# StudentNotExist
source: Student does not exist.
vi: Sinh viên không tồn tại.

# InvalidStatusTransition
source: Cannot change student status from '{0}' to '{1}'.
vi: Không thể chuyển đổi trạng thái sinh viên từ '{0}' sang '{1}'.

# InvalidAddressData
source: Invalid address data. Please fill in all fields or leave all blank.
vi: Địa chỉ không hợp lệ, cần điền tất cả các trường hoặc bỏ trống tất cả.

source: Invalid file.
vi: File không hợp lệ.

source: Invalid CSV data.
vi: Dữ liệu CSV không hợp lệ.

# DepartmentNotFound
source: Department not found: {0}
vi: Không tìm thấy khoa: {0}

# SchoolYearNotFound
source: SchoolYear not found: {0}
vi: Không tìm thấy niên khóa: {0}

# StudyProgramNotFound
source: StudyProgram not found: {0}
vi: Không tìm thấy chương trình học: {0}

# StatusNotFound
source: Status not found: {0}
vi: Không tìm thấy trạng thái: {0}

# AllDataExists
source: All data already exists in the system!
vi: Tất cả dữ liệu đã tồn tại trong hệ thống!

# ImportCsvSuccess
source: CSV import successful ({0} new records).
vi: Import CSV thành công ({0} bản ghi mới).

# ImportCsvError
source: Error occurred while importing CSV: {0}
vi: Lỗi khi import CSV: {0}

source: Invalid JSON data.
vi: Dữ liệu JSON không hợp lệ.

# ImportJsonSuccess
source: JSON import successful ({0} new records).
vi: Import JSON thành công ({0} bản ghi mới).

# ImportJsonError
source: Error occurred while importing JSON: {0}
vi: Lỗi khi import JSON: {0}

source: Invalid department data.
vi: Dữ liệu khoa không hợp lệ.

# GetAllDepartmentsSuccess
source: Department list retrieved successfully.
vi: Lấy danh sách khoa thành công.

# GetDepartmentSuccess
source: Department information retrieved successfully.
vi: Lấy thông tin khoa thành công.

# CreateDepartmentSuccess
source: Department created successfully.
vi: Tạo mới thành công

# UpdateDepartmentSuccess
source: Department updated successfully.
vi: Cập nhật thành công

# DeleteDepartmentSuccess
source: Department deleted successfully.
vi: Xóa khoa thành công

# DeleteDepartmentNotFound
source: Department to delete not found!
vi: Không tìm thấy khoa để xóa!

# DepartmentIdMismatch
source: Department ID does not match!
vi: ID không khớp!

source: Invalid program data.
vi: Dữ liệu chương trình đào tạo không hợp lệ.

# GetAllProgramsSuccess
source: Program list retrieved successfully.
vi: Lấy danh sách chương trình đào tạo thành công.

# GetProgramSuccess
source: Program information retrieved successfully.
vi: Lấy thông tin chương trình đào tạo thành công.

# CreateProgramSuccess
source: Program created successfully.
vi: Chương trình đào tạo đã được tạo thành công.

# CreateProgramExists
source: Program already exists!
vi: Chương trình đào tạo đã tồn tại!

# UpdateProgramSuccess
source: Program updated successfully.
vi: Chương trình đào tạo đã được cập nhật thành công.

# UpdateProgramIdMismatch
source: ID does not match or program does not exist!
vi: ID không khớp hoặc chương trình không tồn tại!

# DeleteProgramSuccess
source: Program deleted successfully.
vi: Chương trình đào tạo đã được xóa thành công.

# DeleteProgramError
source: Cannot delete because there are students in this program or the program was not found!
vi: Không thể xóa vì có sinh viên thuộc chương trình này hoặc không tìm thấy chương trình!

source: Program not found!
vi: Không tìm thấy chương trình đào tạo!

source: Invalid school year data.
vi: Dữ liệu năm học không hợp lệ.

# GetAllSchoolYearsSuccess
source: School year list retrieved successfully.
vi: Lấy danh sách năm học thành công.

# GetSchoolYearSuccess
source: School year information retrieved successfully.
vi: Lấy thông tin năm học thành công.

# CreateSchoolYearSuccess
source: School year created successfully.
vi: Năm học đã được tạo thành công.

# UpdateSchoolYearSuccess
source: School year updated successfully.
vi: Cập nhật năm học thành công.

# DeleteSchoolYearSuccess
source: School year deleted successfully.
vi: Xóa năm học thành công.

# InvalidSchoolYearId
source: Invalid ID or school year does not exist.
vi: ID không hợp lệ hoặc năm học không tồn tại.

# SchoolYearNameRequired
source: School year name is required.
vi: Tên năm học không được để trống.

source: Invalid student status data.
vi: Dữ liệu tình trạng sinh viên không hợp lệ.

# GetAllStudentStatusesSuccess
source: Student status list retrieved successfully.
vi: Lấy danh sách tình trạng sinh viên thành công.

# GetStudentStatusSuccess
source: Student status found.
vi: Tình trạng sinh viên đã được tìm thấy.

source: Student status not found!
vi: Không tìm thấy tình trạng sinh viên!

# CreateStudentStatusExists
source: Student status already exists!
vi: Tình trạng sinh viên đã tồn tại!

# CreateStudentStatusSuccess
source: Student status created successfully.
vi: Tình trạng sinh viên đã được tạo thành công.

# UpdateStudentStatusIdMismatch
source: ID does not match or student status does not exist!
vi: ID không khớp hoặc tình trạng sinh viên không tồn tại!

# UpdateStudentStatusSuccess
source: Student status updated successfully.
vi: Tình trạng sinh viên đã được cập nhật thành công.

# DeleteStudentStatusError
source: Student status does not exist or is currently in use by students!
vi: Tình trạng sinh viên không tồn tại hoặc có sinh viên đang sử dụng tình trạng này!

# DeleteStudentStatusSuccess
source: Student status deleted successfully.
vi: Tình trạng sinh viên đã được xóa thành công.
