Repository: nhattanlht/Group23-Ex-Sat
Catalog: Backend/Resources/ValidationMessages.*.resx
Languages: vi

# PhoneNumber_Required
source: Phone number is required
vi: Số điện thoại không được để trống

# PhoneNumber_ServiceNotFound
source: Phone number validation service not found
vi: Không tìm thấy dịch vụ kiểm tra số điện thoại

# PhoneNumber_CountryNotFound
source: No phone number rule found for country {0}
vi: Không có định dạng số điện thoại cho quốc gia {0}

# PhoneNumber_InvalidFormat
source: Invalid phone number format
vi: Số điện thoại không đúng định dạng

# CreditCount_Range
source: Credit count must be between 2 and 10
vi: Số tín chỉ phải từ 2 đến 10

# StudentId_Required
source: Student ID is required
vi: StudentId không được để trống

# FullName_Required
source: Full name is required
vi: Họ và tên không được để trống

# FullName_StringLength
source: Full name must not exceed 100 characters
vi: Họ và tên không được vượt quá 100 ký tự

# DateOfBirth_Required
source: Date of birth is required
vi: Ngày sinh không được để trống

# Department_Required
source: Department is required
vi: Khoa không được để trống

# Department_StringLength
source: Department name must not exceed 100 characters
vi: Tên khoa không được vượt quá 100 ký tự

# SchoolYear_Required
source: School year is required
vi: Khóa học không được để trống

# StudyProgram_Required
source: Study program is required
vi: Chương trình học không được để trống

# StudyProgram_StringLength
source: Study program name must not exceed 200 characters.
vi: Tên chương trình không được vượt quá 200 ký tự.

# Status_Required
source: Status is required
vi: Tình trạng không được để trống

# PermanentAddress_HouseNumber_Required
source: House number of mailing address is required
vi: Số nhà Địa chỉ nhận thư không được để trống

# PermanentAddress_StreetName_Required
source: Street name of mailing address is required
vi: Tên đường Địa chỉ nhận thư không được để trống

# PermanentAddress_Ward_Required
source: Ward of mailing address is required
vi: Phường Địa chỉ nhận thư không được để trống

# PermanentAddress_District_Required
source: District of mailing address is required
vi: Quận Địa chỉ nhận thư không được để trống

# PermanentAddress_Province_Required
source: Province of mailing address is required
vi: Tỉnh của Địa chỉ nhận thư không được để trống

# PermanentAddress_Country_Required
source: Country of mailing address is required
vi: Quốc gia của Địa chỉ nhận thư không được để trống

# Email_Required
source: Email is required
vi: Email không được để trống

# Email_Invalid
source: Invalid email address
vi: Email không hợp lệ
